/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Telesec-laajennus";
"06 06 02 82 06 01 0A 01"		= "Telesec-mekanismi";

"06 07 02 82 06 01 0A 01 00"	= "Telesec-todentaminen";
"06 08 02 82 06 01 0A 01 00 01"	= "Salasanan todentaminen";
"06 08 02 82 06 01 0A 01 00 02" = "Suojatun salasanan todentaminen";
"06 08 02 82 06 01 0A 01 00 03" = "Yksisuuntainen X.509-todentaminen";
"06 08 02 82 06 01 0A 01 00 04" = "Kaksisuuntainen X.509-todentaminen";
"06 08 02 82 06 01 0A 01 00 05" = "Kolmisuuntainen X.509-todentaminen";
"06 08 02 82 06 01 0A 01 00 06" = "Yksisuuntainen ISO9798-todentaminen";
"06 08 02 82 06 01 0A 01 00 07" = "Kaksisuuntainen ISO9798-todentaminen";
"06 08 02 82 06 01 0A 01 00 08" = "Telekom-todentaminen";

"06 07 02 82 06 01 0A 01 01"	= "Telesec-allekirjoitus";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 jossa RSA ja ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 jossa RSA ja Telesec-allekirjoitusstandardi";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 jossa RSA ja ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 jossa RSA ja Telesec-allekirjoitusstandardi";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 jossa RSA ja Telekom-allekirjoitusstandardi";
"06 08 02 82 06 01 0A 01 01 09"	= "HBCI RSA -allekirjoitus";

"06 07 02 82 06 01 0A 01 02"	= "Telesec-salaus";
"06 08 02 82 06 01 0A 01 02 00"	= "ei mitään";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Yksisuuntainen funktio";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Lohkosalausta käyttävä tiivistefunktio";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "FEC-funktio";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Telesec-moduuli";
"06 07 02 82 06 01 0A 02 00"	= "Algoritmit";
"06 07 02 82 06 01 0A 02 01"	= "Attribuuttityypit";
"06 07 02 82 06 01 0A 02 02"	= "Varmennetyypit";
"06 07 02 82 06 01 0A 02 03"	= "Viestityypit";
"06 07 02 82 06 01 0A 02 04"	= "PL-protokolla";
"06 07 02 82 06 01 0A 02 05"	= "SME ja SME:n osia";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Hyödyllisiä määritelmiä";
"06 07 02 82 06 01 0A 02 08"	= "STE-tiedostoja";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Sähköinen tilaus";
"06 07 02 82 06 01 0A 02 0B"	= "Telesec TTP -asymmetrinen sovellus";
"06 07 02 82 06 01 0A 02 0C"	= "Telesec TTP -perussovellus";
"06 07 02 82 06 01 0A 02 0D"	= "Telesec TTP -viestit";
"06 07 02 82 06 01 0A 02 0E"	= "Telesec TTP -aikaleimasovellus";

"06 06 02 82 06 01 0A 03"		= "Objektin luokka";
"06 07 02 82 06 01 0A 03 00"	= "Telesec muu nimi";
"06 07 02 82 06 01 0A 03 01"	= "Hakemisto";
"06 07 02 82 06 01 0A 03 02"	= "Hakemiston tyyppi";
"06 07 02 82 06 01 0A 03 03"	= "Hakemiston ryhmä";
"06 07 02 82 06 01 0A 03 04"	= "Hakemiston käyttäjä";
"06 07 02 82 06 01 0A 03 05"	= "Symmetrinen avaintietue";

"06 06 02 82 06 01 0A 04"		= "Paketti";
"06 06 02 82 06 01 0A 05"		= "Parametri";
"06 06 02 82 06 01 0A 06"		= "Virtuaaliosoite";
"06 06 02 82 06 01 0A 07"		= "Attribuutti";
"06 07 02 82 06 01 0A 07 00"	= "Sovellusryhmän tunnus";
"06 07 02 82 06 01 0A 07 01"	= "Varmennetyyppi";
"06 07 02 82 06 01 0A 07 02"	= "Telesec-varmenne";
"06 07 02 82 06 01 0A 07 03"	= "Varmennenumero";
"06 07 02 82 06 01 0A 07 04"	= "Varmenteen sulkulista";
"06 07 02 82 06 01 0A 07 05"	= "Luontipäivä";
"06 07 02 82 06 01 0A 07 06"	= "Myöntäjä";
"06 07 02 82 06 01 0A 07 07"	= "Nimiviranomainen";
"06 07 02 82 06 01 0A 07 08"	= "Julkisten avainten hakemisto";
"06 07 02 82 06 01 0A 07 09"	= "Suojausdomain";
"06 07 02 82 06 01 0A 07 0A"	= "Aihe";
"06 07 02 82 06 01 0A 07 0B"	= "Peruutusaika";
"06 07 02 82 06 01 0A 07 0C"	= "Käyttäjäryhmän viite";
"06 07 02 82 06 01 0A 07 0D"	= "Kelpoisuus";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Suojausviestiympäristö";
"06 07 02 82 06 01 0A 07 10"	= "Anonyymi julkisten avainten hakemisto";
"06 07 02 82 06 01 0A 07 11"	= "Telesec-etunimi";
"06 07 02 82 06 01 0A 07 12"	= "Nimen lisäykset";
"06 07 02 82 06 01 0A 07 13"	= "Telesec-postinumero";
"06 07 02 82 06 01 0A 07 14"	= "Nimen pääte";
"06 07 02 82 06 01 0A 07 15"	= "Telesec-varmenneluettelo";
"06 07 02 82 06 01 0A 07 16"	= "Teletrust-varmenneluettelo";
"06 07 02 82 06 01 0A 07 17"	= "X.509-varmenneluettelo";
"06 07 02 82 06 01 0A 07 18"	= "Antopäivä";
"06 07 02 82 06 01 0A 07 19"	= "Fyysinen korttinumero";
"06 07 02 82 06 01 0A 07 1A"	= "Tiedostomuoto";
"06 07 02 82 06 01 0A 07 1B"	= "Ctl-tiedosto on arkisto";
"06 07 02 82 06 01 0A 07 1C"	= "Sähköpostiosoite";
"06 07 02 82 06 01 0A 07 1D"	= "Varmenteiden malliluettelo";
"06 07 02 82 06 01 0A 07 1E"	= "Hakemiston nimi";
"06 07 02 82 06 01 0A 07 1F"	= "Hakemiston tyyppitunnus";
"06 07 02 82 06 01 0A 07 20"	= "Hakemiston ryhmätunnus";
"06 07 02 82 06 01 0A 07 21"	= "Hakemiston käyttäjätunnus";
"06 07 02 82 06 01 0A 07 22"	= "Perumislippu";
"06 07 02 82 06 01 0A 07 23"	= "Symmetrisen avaintietueen nimi";
"06 07 02 82 06 01 0A 07 24"	= "GL-numero";
"06 07 02 82 06 01 0A 07 25"	= "GO-numero";
"06 07 02 82 06 01 0A 07 26"	= "G-avaintieto";
"06 07 02 82 06 01 0A 07 27"	= "Z-avaindata";
"06 07 02 82 06 01 0A 07 28"	= "KT-avaintieto";
"06 07 02 82 06 01 0A 07 2A"	= "KT-avainnumero";
"06 07 02 82 06 01 0A 07 33"	= "Peruutuksen luonnin aika";
"06 07 02 82 06 01 0A 07 34"	= "Vastuuteksti";

"06 06 02 82 06 01 0A 08"		= "Attribuuttiryhmä";
"06 06 02 82 06 01 0A 09"		= "Toiminto";
"06 06 02 82 06 01 0A 0A"		= "Ilmoitus";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Suojausohjelma";

"06 06 02 82 06 01 0A 0C"		= "Varmenne- ja CRL-laajennusten määritykset";

"06 07 02 82 06 01 0A 0C 00"	= "Varmenteen laajennuksen vastuun rajoituksen laajennus";
"06 07 02 82 06 01 0A 0C 01"	= "Telesec-varmennetunnuksen laajennus";
"06 07 02 82 06 01 0A 0C 02"	= "Telesec-käytäntötunnus";
"06 07 02 82 06 01 0A 0C 03"	= "Telesec-käytäntömääritteen tunnus";
"06 07 02 82 06 01 0A 0C 04"	= "Telesec CRL-suodatettu laajennus";
"06 07 02 82 06 01 0A 0C 05"	= "Telesec CRL-suodatinlaajennus";
"06 07 02 82 06 01 0A 0C 06"	= "Telesec-nimiviranomaisen laajennus";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "Käyttäjätunnus";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "RFC822-postilaatikko";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Domain Component";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Australialainen liiketunnus";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Certificates Australia Policy Identifier";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet henkilökohtainen";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet Business";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet laillinen";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet-pilotti";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Signet-käytäntötunnus";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Symmetrinen salausalgoritmi";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "SEIS High-Assurance -menetelmätunnus";
"06 06 2A 85 70 22 01 02"	= "SEIS GAK -menetelmätunnus";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "SEIS AT -henkilötunnus";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "ANSI X9.57 -moduuli";
"06 07 2A 86 48 CE 38 01 01"	= "X9F1-varmenteen hallinta";
"06 06 2A 86 48 CE 38 02"		= "Pito-ohje";
"06 07 2A 86 48 CE 38 02 01"	= "Pito-ohje - Ei mitään";
"06 07 2A 86 48 CE 38 02 02"	= "Soittaja";
"06 07 2A 86 48 CE 38 02 03"	= "Hylkää";
"06 07 2A 86 48 CE 38 02 04"	= "Vastausmerkki";
"06 06 2A 86 48 CE 38 03"		= "Attribuutti";
"06 06 2A 86 48 CE 38 03 01"	= "Vasta-allekirjoitus";
"06 06 2A 86 48 CE 38 03 02"	= "Attribuuttivarmenne";
"06 06 2A 86 48 CE 38 04"		= "Algoritmi";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA-täsmäys";
"06 07 2A 86 48 CE 38 04 03"	= "DSA ja SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "ANSI X9.62 -kenttätyyppi";
"06 07 2A 86 48 CE 3D 01 01"	= "Prime Field";
"06 07 2A 86 48 CE 3D 01 02"	= "Characteristic-Two Field";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Characteristic-Two Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Null Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Trinomial Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Pentanomial Basis";
"06 06 2A 86 48 CE 3D 02"		= "Julkisen avaimen tyyppi";
"06 07 2A 86 48 CE 3D 02 01"	= "Elliptic Curve julkinen avain";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "ANSI X9.42 -kenttätyyppi";
"06 07 2A 86 48 CE 3E 01 01"	= "Galois Field Prime";
"06 06 2A 86 48 CE 3E 02"		= "Numeron tyyppi";
"06 07 2A 86 48 CE 3E 02 01"	= "Diffie-Hellman julkinen avain";
"06 06 2A 86 48 CE 3E 03"		= "Malli";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman staattinen";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman Ephemeral";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman Hybrid 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman Hybrid 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Entrust-versiotiedot";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE jossa MD5 ja CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "Salasanapohjainen MAC";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Entrust-käyttäjä";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Entrust-valtuuttajan tiedot";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Attribuuttivarmenne";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "RSA-salaus";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 ja RSA-salaus";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 ja RSA-salaus";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 ja RSA-salaus";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 ja RSA-salaus";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP-salaus (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP-salaus";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "Määritetty RSA-OAEP-tunnus";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "RSA-PSS-allekirjoitussuunnitelma";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 ja RSA-salaus";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 ja RSA-salaus";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 ja RSA-salaus";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-1 ja RSA-salaus";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "BSAFE RSA -salaus";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Diffie-Hellman avainsopimus";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE jossa MD2 ja DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE jossa MD5 ja DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE jossa MD2 ja RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE jossa MD5 ja RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE jossa MD5 ja XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE jossa SHA ja DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Tieto";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Allekirjoitettu tieto";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Ympäröity tieto";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Allekirjoitettu ja ympäröity tieto";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Pakattu tieto";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Salattu data";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Data jossa attribuutteja";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Salatun yksityisen avaimen tiedot";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Sähköpostiosoite";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Rakenteeton nimi";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Sisällön tyyppi";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Message Digest";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Allekirjoitusaika";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Vasta-allekirjoitus";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Challenge Password";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Rakenteeton osoite";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Laajennetut varmenneatribuutit";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Myöntäjä ja sarjanumero";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Salasanan tarkistus";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Julkinen avain";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Allekirjoituksen kuvaus";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Laajennuspyyntö";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "S/MIME-ominaisuudet";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Suosi allekirjoitettua dataa";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Ei voi purkaa mitään";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Kuittauspyyntö";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Kuitti";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Sisältövihjeet";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Mail List Expansion History";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "S/MIME-moduulit";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Cryptographic Message Syntax";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Parannetut suojauspalvelut";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "S/MIME-objektin tunniste";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "S/MIME V3 -viesti";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Elektroninen ETS-allekirjoitus 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Elektroninen ETS-allekirjoitus 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Elektroninen ETS-allekirjoituskäytäntö 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Elektroninen ETS-allekirjoituskäytäntö 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "S/MIME-sisältötyypit";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Todennetut S/MIME-attribuutit";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "S/MIME-algoritmit";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "S/MIME-varmenteen jakelu";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "LDAP-varmenteen jakelu";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "S/MIME-allekirjoituksen käytäntötarkenne";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "S/MIME-allekirjoitustyypin tunniste";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Alullepanijan allekirjoitus";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Domain Signature";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Lisäatribuuttien allekirjoitus";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Tarkistusallekirjoitus";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "S/MIME-ominaisuudet";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Prefer Binary Inside";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Kutsumanimi (PKCS-12:lle)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Local Key ID (PKCS-12:lle)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Varmennetyypit (PKCS-12:lle)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "X.509-varmenne (PKCS-12:lle)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "SDSI-varmenne (PKCS-12:lle)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "CRL-tyypit (PKCS-12:lle)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (PKCS-12:lle)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12-henkilötietojen vaihtosyntaksi";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "PKCS-12 salasanapohjaiset suojaustunnisteet";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE jossa SHA-1 ja 128-bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE jossa SHA-1 ja 40-bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE jossa SHA-1 ja 3-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE jossa SHA-1 ja 2-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE jossa SHA-1 ja 128-Bit RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE jossa SHA-1 ja 40-bit RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK-tunnisteet";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "PKCS-12 PKCS-8 Key Shrouding";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12 Bag IDs";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "PKCS-12 Key Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "PKCS-12 Certificate and CRL Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "PKCS-12 Secret Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "PKCS-12 Safe Contents ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "PKCS-12 PKCS-8 Shrouded Key Bag ID";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "PKCS-12 Certificate Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "PKCS-12 X.509 -varmenne ja CRL Bag -tunnus";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "PKCS-12 SDSI Certificate Bag ID";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "PKCS-12 salasanapohjainen suojaustunniste";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE jossa SHA-1 ja 128-bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE jossa SHA-1 ja 40-bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE jossa SHA-1 ja Triple DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE jossa SHA-1 ja 128-bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE jossa SHA-1 ja 40-bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE jossa SHA-1 ja RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE jossa SHA-1 ja RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "PKCS-12 Enveloping IDs";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "PKCS-12 RSA-salaus ja 128-bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "PKCS-12 RSA-salaus ja 40-bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "PKCS-12 RSA-salaus ja Triple DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "PKCS-12-allekirjoitustunnus";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "PKCS-12 RSA-allekirjoitus ja SHA-1 Digest";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12-versio 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12 Bag IDs";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12 Key Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "PKCS-12 PKCS-8 Shrouded Key Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "PKCS-12 Certificate Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12 CRL Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "PKCS-12 Secret Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "PKCS-12 Safe Contents Bag";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "PKCS-15-moduulit";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "PKCS-15-attribuutit";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "PKCS-15-sisältötyyppi";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "PKCS-15-sisältö";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "RSADSI-tiivistealgoritmi";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC ja SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "RSADSI-salausalgoritmi";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 ja MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Tuntematon Identrus-käytäntötunniste";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT User-to-User Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Microsoft Exchange Server -objektiluokka";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Sivuston osoitteenmääritys";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Class Schema";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Määriterakenne";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Mailbox-Agent";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Postilaatikko";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Säiliö";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Vastaanottaja";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Delivery Mechanism";

"06 07 2A 86 48 86 F7 14 04"				= "Microsoftin tiedostomuodot";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Epäsuora SPC-tietokonteksti";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "SPC-julkaisijatiedot";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "SPC-tietotyyppi";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "SPC Opus -tiedot";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "SPC-varmenteen laajennukset";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "SPC PE-kuvadata";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC-linkki (tyyppi 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Individual Code Signing";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Commercial Code Signing";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC-linkki (tyyppi 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "SPC-vähimmäiskriteerit";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Taloudelliset SPC-kriteerit";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC-linkki (tyyppi 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "NTLM-suojaustuen toimittaja";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Aikaleimauksen vasta-allekirjoitus";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Certificate Trust List";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Lajitellut CTL-laajennukset";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Seuraavan päivityksen sijainti";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Parannettu avaimen käyttö";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Certificate Trust List Signing";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Aikaleimauksen allekirjoitus";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Server Gated Crypto";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Sarjamuotoinen salaus";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Salatut tiedostojärjestelmät";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Salattujen tiedostojärjestelmien palautus";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Windows- yhteensopiva laitteisto";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "NT5-allekirjoitus";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Windows-laitteiston OEM-allekirjoitus";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Sulautettu NT-allekirjoitus";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Luotettu pääluetteloallekirjoitus";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Kelpaava alistaminen";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Avaimen palauttaminen";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Dokumentin allekirjoitus";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Attribute Object Identifiers";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Kyllä/Ei luottamus-attribuutti";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM Individualization";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Microsoft Licenses";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoftin käyttöoikeuspalvelin";

"06 08 2B 06 01 04 01 82 37 0D"				= "Microsoft PKCS-10 Object Identifiers";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Uudistusvarmenne";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Liittymisnimen arvopari";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "Enrollment CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "OS-versio";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Microsoft PKCS-12 -attribuutit";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Local Machine Keyset";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft Enrollment -infrastruktuuri";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Auto-Enroll CTL Usage";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Enrollment Certificate Type";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Rekisteröintiagentti
";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Älykorttikirjautuminen";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "NT:n ensisijainen nimi";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoftin varmennepalvelimen infrastruktuuri";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Microsoft CA Renewal Version";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "CAPICOM-versio";
"06 09 2B 06 01 04 01 82 37 58 02"			= "CAPICOM-attribuutti";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Dokumentin nimi";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Dokumentin kuvaus";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Salattu data";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Sisältö salattu";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "UNINETT-käytäntötunnus";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ICE-TEL-käytäntötunnus";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ICE-TEL CA Policy Identifier";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal ja SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal ja RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "cryptlib-attribuutit";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "cryptlib Presence Check";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP-vastaus RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "Laajennettu OCSP-vastaus RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "CRL Extended Reason";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Avaimen ominaisuudet";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI Boot";
"06 09 2B 06 01 04 01 97 55 04 01"			= "cryptlib-sisältö";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "cryptlib Configuration Data";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "cryptlib User Index";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "cryptlib-käyttäjän tiedot";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "XYZZY-käytäntötunnus";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "Time Signature System";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Time Signature System 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Time Signature System 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Time Signature System 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Toissijaiset käytännöt";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Lääkäritunnus";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Kerberos-todentamisdata";
"06 07 2B 06 01 05 02 03 02"        = "Kerberos Diffie-Hellman -avaindata";
"06 07 2B 06 01 05 02 03 03"        = "Kerberos-vastausavaindata";
"06 07 2B 06 01 05 02 03 04"        = "Kerberos-asiakastodentaminen";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos-avainten jakelukeskus (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Simple Public Key Mechanism (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Julkisen avaimen infrastruktuuri";

"06 07 2B 06 01 05 05 07 01"		= "PKIX-yksityisyysvarmenteen laajennus";
"06 08 2B 06 01 05 05 07 01 01"		= "Certificate Authority Information Access";
"06 08 2B 06 01 05 05 07 01 02"		= "Biometriset tiedot";
"06 08 2B 06 01 05 05 07 01 03"		= "Hyväksytyt varmennetiedot";
"06 08 2B 06 01 05 05 07 01 04"		= "Attribuuttivarmenteen valvontatiedot";
"06 08 2B 06 01 05 05 07 01 05"		= "Attribute Certificate Targeting";
"06 08 2B 06 01 05 05 07 01 06"		= "Attribuuttivarmenteen myöntäjän säätimet";
"06 08 2B 06 01 05 05 07 01 07"		= "SBGP IP-osoitelohko";
"06 08 2B 06 01 05 05 07 01 08"		= "autonomisen SBGP-järjestelmän tunniste";
"06 08 2B 06 01 05 05 07 01 09"		= "SBGP-reitittimen tunniste";
"06 08 2B 06 01 05 05 07 01 0A"		= "Attribute Certificate Proxying";
"06 08 2B 06 01 05 05 07 01 0B"		= "Aihetietojen käyttöoikeus";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotyyppi";

"06 07 2B 06 01 05 05 07 02"		= "Käytäntömääritteiden tyypit";
"06 08 2B 06 01 05 05 07 02 01"		= "Varmennemenettelytiedot";
"06 08 2B 06 01 05 05 07 02 02"		= "Käyttäjälle tiedoksi";
"06 08 2B 06 01 05 05 07 02 03"		= "Tekstimuistiinpano";

"06 07 2B 06 01 05 05 07 03"		= "Avaimen tarkoitus";
"06 08 2B 06 01 05 05 07 03 01"		= "Palvelimen autentikointi";
"06 08 2B 06 01 05 05 07 03 02"		= "Asiakkaan todentaminen";
"06 08 2B 06 01 05 05 07 03 03"		= "Koodin allekirjoitus";
"06 08 2B 06 01 05 05 07 03 04"		= "Sähköpostisuojaus";
"06 08 2B 06 01 05 05 07 03 05"		= "IPSEC End System";
"06 08 2B 06 01 05 05 07 03 06"		= "IPSEC Tunnel";
"06 08 2B 06 01 05 05 07 03 07"		= "IPSEC-käyttäjä";
"06 08 2B 06 01 05 05 07 03 08"		= "Aikaleimaus";
"06 08 2B 06 01 05 05 07 03 09"		= "OCSP-allekirjoitus";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "SBGP AA -palvelimen todentaminen";

"06 07 2B 06 01 05 05 07 04"		= "CMP-tietotyypit";
"06 08 2B 06 01 05 05 07 04 01"		= "Salausvarmenne CA-protokollalle";
"06 08 2B 06 01 05 05 07 04 02"		= "Allekirjoitusavainparityypit";
"06 08 2B 06 01 05 05 07 04 03"		= "Salauksen avainparityypit";
"06 08 2B 06 01 05 05 07 04 04"		= "Ensisijainen symmetrinen algoritmi";
"06 08 2B 06 01 05 05 07 04 05"		= "CA-avaimen päivitystiedot";
"06 08 2B 06 01 05 05 07 04 06"		= "Nykyinen CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "Ei-tuetut OID:t";
"06 08 2B 06 01 05 05 07 04 08"		= "Tilauspyyntö";
"06 08 2B 06 01 05 05 07 04 09"		= "Tilausvastaus";
"06 08 2B 06 01 05 05 07 04 0A"		= "Key Pair Parameter Request";
"06 08 2B 06 01 05 05 07 04 0B"		= "Key Pair Parameter Response";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "CRMF-rekisteröinti";
"06 08 2B 06 01 05 05 07 05 01"		= "Rekisteröintihallinta";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Rekisteröintitunnus";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Authenticator";
"06 09 2B 06 01 05 05 07 05 01 03"	= "PKI-julkaisutiedot";
"06 09 2B 06 01 05 05 07 05 01 04"	= "PKI-arkistointiasetukset";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Vanha varmennetunniste";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Protokollan salausavain";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Vaihtoehtoinen varmennemalli";
"06 09 2B 06 01 05 05 07 05 01 08"	= "WAP WTLS -työpohja";

"06 08 2B 06 01 05 05 07 05 02"		= "CRMF-rekisteröintitiedot";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8 Pairs";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Varmennepyyntö";

"06 07 2B 06 01 05 05 07 06"		= "Algoritmit";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Ei allekirjoitusta";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "CMC-säätimet";

"06 07 2B 06 01 05 05 07 08"		= "Muut nimet";
"06 08 2B 06 01 05 05 07 08 01"		= "Henkilötiedot";
"06 08 2B 06 01 05 05 07 08 02"		= "Käyttäjäryhmä";

"06 07 2B 06 01 05 05 07 09"		= "Henkilötiedot";
"06 08 2B 06 01 05 05 07 09 01"		= "Syntymäaika";
"06 08 2B 06 01 05 05 07 09 02"		= "Syntymäpaikka";
"06 08 2B 06 01 05 05 07 09 03"		= "Salanimi";
"06 08 2B 06 01 05 05 07 09 04"		= "Sukupuoli";
"06 08 2B 06 01 05 05 07 09 05"		= "Kansalaisuus";
"06 08 2B 06 01 05 05 07 09 06"		= "Asuinmaa";

"06 07 2B 06 01 05 05 07 0A"		= "Attribuuttivarmenne";
"06 08 2B 06 01 05 05 07 0A 01"		= "Todentamistiedot";
"06 08 2B 06 01 05 05 07 0A 02"		= "Käyttäjäidentiteetti";
"06 08 2B 06 01 05 05 07 0A 03"		= "Charging Identity";
"06 08 2B 06 01 05 05 07 0A 04"		= "Ryhmä";
"06 08 2B 06 01 05 05 07 0A 05"		= "Rooli";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Online-varmenteen tilaprotokolla";
"06 09 2B 06 01 05 05 07 30 01 01"	= "OCSP Basic Response";
"06 09 2B 06 01 05 05 07 30 01 02"	= "OCSP Nonce Extension";
"06 09 2B 06 01 05 05 07 30 01 03"	= "OCSP CRL -viittaus";
"06 09 2B 06 01 05 05 07 30 01 04"	= "OCSP-vastaus";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP ei kumoustarkastusta";
"06 09 2B 06 01 05 05 07 30 01 06"	= "OCSP Archive Cutoff";
"06 09 2B 06 01 05 05 07 30 01 07"	= "OCSP-palvelupaikannin";

"06 08 2B 06 01 05 05 07 30 02"		= "Varmenteen myöntäjä";
"06 08 2B 06 01 05 05 07 30 03"		= "Aikaleimaus";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE Intermediate";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "DEC-salausalgoritmi";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "DEC-tiivistefunktio";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "DEC-allekirjoitusalgoritmi";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 ja RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 ja RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 ja RSA";
"06 05 2B 0E 03 02 03"				= "MD5 ja RSA";
"06 05 2B 0E 03 02 04"				= "MD4 ja RSA-salaus";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N ja RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "RSA-allekirjoitus";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA ja SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 ja RSA-allekirjoitus";
"06 05 2B 0E 03 02 0F"				= "SHA ja RSA-allekirjoitus";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman ja Common Modulus";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Common";
"06 05 2B 0E 03 02 15"				= "DSA Common ja SHA";
"06 05 2B 0E 03 02 16"				= "RSA-avaimen kuljetus";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 ja RSA-allekirjoitus";
"06 05 2B 0E 03 02 19"				= "MD5 ja RSA-allekirjoitus";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA ja SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA ja Common SHA-1";
"06 05 2B 0E 03 02 1D"				= "SHA-1 ja RSA-salaus";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mekanismi";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 ja RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 ja ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Dokumentti";
"06 04 2B 24 01 01"					= "Lopullinen versio";
"06 04 2B 24 01 02"					= "Luonnos";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritmi";
"06 04 2B 24 03 01"					= "Salausalgoritmi";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "RSA-salaus";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Hash-algoritmi";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 Single Length";
"06 05 2B 24 03 02 05"				= "MDC2 Double Length";
"06 04 2B 24 03 03"					= "Allekirjoitusalgoritmi";
"06 05 2B 24 03 03 01"				= "RSA-allekirjoitus";

"06 06 2B 24 03 03 01 01"			= "RSA-allekirjoitus ja SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "RSA-allekirjoitus ja SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "RSA-allekirjoitus ja SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "RSA-allekirjoitus ja SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "RSA-allekirjoitus ja SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "RSA-allekirjoitus ja SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "RSA-allekirjoitus ja SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "RSA-allekirjoitus ja SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "RSA-allekirjoitus ja SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "RSA-allekirjoitus ja SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "RSA-allekirjoitus ja SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "RSA-allekirjoitus ja SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "RSA-allekirjoitus ja SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "RSA-allekirjoitus ja SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "RSA-allekirjoitus ja SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "RSA-allekirjoitus ja SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "RSA-allekirjoitus ja SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "RSA-allekirjoitus ja SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "RSA-allekirjoitus ja SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "RSA-allekirjoitus ja SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "RSA-allekirjoitus ja SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "RSA-allekirjoitus ja SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "RSA-allekirjoitus ja SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "RSA-allekirjoitus ja SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "RSA-allekirjoitus ja SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "RSA-allekirjoitus ja SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "RSA-allekirjoitus ja RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "RSA-allekirjoitus ja RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "RSA-allekirjoitus ja RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "RSA-allekirjoitus ja RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "RSA-allekirjoitus ja RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "RSA-allekirjoitus ja RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "RSA-allekirjoitus ja RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "RSA-allekirjoitus ja RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "RSA-allekirjoitus ja RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "RSA-allekirjoitus ja RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "RSA-allekirjoitus ja RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "RSA-allekirjoitus ja RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "RSA-allekirjoitus ja RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "RSA-allekirjoitus ja RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "RSA-allekirjoitus ja RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "RSA-allekirjoitus ja RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "RSA-allekirjoitus ja RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "RSA-allekirjoitus ja RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "RSA-allekirjoitus ja RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "RSA-allekirjoitus ja RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "RSA-allekirjoitus ja RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "RSA-allekirjoitus ja RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "RSA-allekirjoitus ja RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "RSA-allekirjoitus ja RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "RSA-allekirjoitus ja RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "RSA-allekirjoitus ja RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "RSA-allekirjoitus ja RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "RSA-allekirjoitus ja RIPEMD-256";

"06 05 2B 24 03 03 02"				= "ECSIE-allekirjoitus";
"06 06 2B 24 03 03 02 01"			= "ECSIE-allekirjoitus ja SHA-1";
"06 06 2B 24 03 03 02 02"			= "ECSIE-allekirjoitus ja RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "ECSIE-allekirjoitus ja MD2";
"06 06 2B 24 03 03 02 04"			= "ECSIE-allekirjoitus ja MD5";

"06 04 2B 24 03 04"					= "Allekirjoitussuunnitelma";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 ja RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 ja RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 ja RND";

"06 03 2B 24 04"					= "Attribuutti";
"06 03 2B 24 05"					= "Käytäntö";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "Valmistajakohtainen API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "Toimintokohtainen API";
"06 03 2B 24 07"					= "Avaintenhallinta";
"06 04 2B 24 07 01"					= "Avainsopimus";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Avaimen siirto";
"06 05 2B 24 07 02 01"				= "ISO9796-2 ja RSA-salaus";

"06 05 2B 24 08 01 01"				= "Teletrust SigiSigConform -käytäntötunnistin";
"06 05 2B 24 08 02 01"				= "Hakemistopalvelu";

"06 05 2B 24 08 03 01"				= "Varmenteen luontipäivä";
"06 05 2B 24 08 03 02"				= "Valtakirja";
"06 05 2B 24 08 03 03"				= "Pääsy";
"06 05 2B 24 08 03 04"				= "Valuuttaraja";
"06 05 2B 24 08 03 05"				= "Declaration of Majority";
"06 05 2B 24 08 03 06"				= "Piirikortin sarjanumero";
"06 05 2B 24 08 03 07"				= "Julkisen avaimen viite";
"06 05 2B 24 08 03 08"				= "Rajoitus";
"06 05 2B 24 08 03 09"				= "Hae jos sallittua";
"06 05 2B 24 08 03 0A"				= "Pyydetty varmenne";
"06 05 2B 24 08 03 0B"				= "Nimiviranomaiset";
"06 05 2B 24 08 03 0C"				= "Varmenne hakemistossa alkaen";
"06 05 2B 24 08 03 0D"				= "Varmennetiiviste";

"06 05 2B 24 08 04 01"				= "Henkilötiedot";
"06 05 2B 24 08 04 08"				= "Rajoitus";
"06 07 2B 24 08 05 01 01 01"		= "RSA osoittaa SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA osoittaa RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA ja SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA ja RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA Extended";
"06 07 2B 24 08 05 01 02 02"		= "DSA ja RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Varmenne";
"06 05 2B 24 08 06 02"				= "Varmenneviittaus";
"06 05 2B 24 08 06 03"				= "Attribuuttivarmenne";
"06 05 2B 24 08 06 04"				= "Attribuuttiviittaus";
"06 05 2B 24 08 06 05"				= "Tiedostonimi";
"06 05 2B 24 08 06 06"				= "Tallennusaika";
"06 05 2B 24 08 06 07"				= "Tiedoston koko";
"06 05 2B 24 08 06 08"				= "Sijainti";
"06 05 2B 24 08 06 09"				= "Allekirjoituksen numero";
"06 05 2B 24 08 06 0A"				= "Automaattisesti luotu";

"06 05 2B 24 08 07 01"				= "Teletrust-esitystyypit";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binääri";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Teksti";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Thawte-varmennelaajennus";
"06 05 2B 65 01 04 01"				= "Vahva extranet";

/* X.520 */

"06 02 55 04"		= "X.520-attribuuttityypit";
"06 03 55 04 00"	= "Objektin luokka";
"06 03 55 04 01"	= "Nimetty tietuenimi";
"06 03 55 04 02"	= "Tietämystieto";
"06 03 55 04 03"	= "Yleisnimi";
"06 03 55 04 04"	= "Sukunimi";
"06 03 55 04 05"	= "Sarjanumero";
"06 03 55 04 06"	= "Maan nimi";
"06 03 55 04 07"	= "Paikkakunnan nimi";
"06 04 55 04 07 01"	= "Kollektiivinen paikkakunnan nimi";
"06 03 55 04 08"	= "Osavalt. tai läänin nimi";
"06 04 55 04 08 01"	= "Kollektiivinen osavaltion tai läänin nimi";
"06 03 55 04 09"	= "Katuosoite";
"06 04 55 04 09 01"	= "Kollektiivinen katuosoite";
"06 03 55 04 0A"	= "Organisaation nimi";
"06 04 55 04 0A 01"	= "Kollektiivinen organisaation nimi";
"06 03 55 04 0B"	= "Yksikön nimi";
"06 04 55 04 0B 01"	= "Kollektiivinen yksikön nimi";
"06 03 55 04 0C"	= "Otsikko";
"06 03 55 04 0D"	= "Kuvaus";
"06 03 55 04 0E"	= "Hakuopas";
"06 03 55 04 0F"	= "Toimiala";
"06 03 55 04 10"	= "Postiosoite";
"06 04 55 04 10 01"	= "Kollektiivinen postiosoite";
"06 03 55 04 11"	= "Postinumero";
"06 04 55 04 11 01"	= "Kollektiivinen postinumero";
"06 03 55 04 12"	= "Postilokero";
"06 04 55 04 12 01"	= "Kollektiivinen postilokero";
"06 03 55 04 13"	= "Jakelutoimiston nimi";
"06 04 55 04 13 01"	= "Kollektiivinen jakelutoimiston nimi";
"06 03 55 04 14"	= "Puhelinnumero";
"06 04 55 04 14 01"	= "Kollektiivinen puhelinnumero";
"06 03 55 04 15"	= "Teleksinumero";
"06 04 55 04 15 01"	= "Kollektiivinen teleksinumero";
"06 03 55 04 16"	= "Teleksipäätteen tunnus";
"06 04 55 04 16 01"	= "Kollektiivinen teleksipäätteen tunnus";
"06 03 55 04 17"	= "Faksinumero";
"06 04 55 04 17 01"	= "Kollektiivinen faksinumero";
"06 03 55 04 18"	= "X.121-osoite";
"06 03 55 04 19"	= "Kansainvälinen ISDN-numero";
"06 04 55 04 19 01"	= "Kollektiivinen kansainvälinen ISDN-numero";
"06 03 55 04 1A"	= "Rekisteröity osoite";
"06 03 55 04 1B"	= "Määräpaikan kilpi";
"06 03 55 04 1C"	= "Ensisijainen toimitustapa";
"06 03 55 04 1D"	= "Esitysosoite";
"06 03 55 04 1E"	= "Tuettu sovelluskonteksti";
"06 03 55 04 1F"	= "Jäsen";
"06 03 55 04 20"	= "Omistaja";
"06 03 55 04 21"	= "Roolin haltija";
"06 03 55 04 22"	= "Katso myös";
"06 03 55 04 23"	= "Käyttäjän salasana";
"06 03 55 04 24"	= "Käyttäjän varmenne";
"06 03 55 04 25"	= "Varmentajan varmenne";
"06 03 55 04 26"	= "Varmentajan sulkulista";
"06 03 55 04 27"	= "Varmenteen sulkulista";
"06 03 55 04 28"	= "Ristiinvarmennuspari";
"06 03 55 04 29"	= "Nimi";
"06 03 55 04 2A"	= "Etunimi";
"06 03 55 04 2B"	= "Nimikirjaimet";
"06 03 55 04 2C"	= "Sukupolvitunniste";
"06 03 55 04 2D"	= "Ainutkertainen tunniste";
"06 03 55 04 2E"	= "DN-määre";
"06 03 55 04 2F"	= "Parannettu hakuopas";
"06 03 55 04 30"	= "Protokollatiedot";
"06 03 55 04 31"	= "Yksikäsitteinen nimi";
"06 03 55 04 32"	= "Ainutkertainen jäsen";
"06 03 55 04 33"	= "Talon tunniste";
"06 03 55 04 34"	= "Tuetut algoritmit";
"06 03 55 04 35"	= "Delta-sulkulista";
"06 03 55 04 36"	= "Lupa";
"06 03 55 04 3A"	= "Ristiinvarmennuspari";

/* X.500 object classes */

"06 02 55 06"		= "X.520-objektiluokka";
"06 03 55 06 00"	= "Ylhäältä";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "Maa";
"06 03 55 06 03"	= "Paikallisuus";
"06 03 55 06 04"	= "Organisaatio";
"06 03 55 06 05"	= "Yksikkö";
"06 03 55 06 06"	= "Henkilö";
"06 03 55 06 07"	= "Organisaation henkilö";
"06 03 55 06 08"	= "Organisaation rooli";
"06 03 55 06 09"	= "Nimiryhmä";
"06 03 55 06 0A"	= "Asuinalueen henkilö";
"06 03 55 06 0B"	= "Sovellusprosessi";
"06 03 55 06 0C"	= "Sovellusolio";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Laite";
"06 03 55 06 0F"	= "Vahvan todentamisen käyttäjä";
"06 03 55 06 10"	= "Varmentaja";
"06 03 55 06 11"	= "Ainutkertaisten nimien ryhmä";
"06 03 55 06 15"	= "PKI-käyttäjä";
"06 03 55 06 16"	= "PKI-varmentaja";

/* X.500 algorithms */

"06 02 55 08"		= "X.500-algoritmit";
"06 03 55 08 01"	= "X.500-salausalgoritmit";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "X.509-varmennelaajennokset";
"06 03 55 1D 01"	= "Varmentajan avaintunniste (AKID), vanha";
"06 03 55 1D 02"	= "Ensisijaiset avainattribuutit (vanha)";
"06 03 55 1D 03"	= "Varmennekäytännöt (vanha)";
"06 03 55 1D 04"	= "Avaimen käyttörajoitus (vanha)";
"06 03 55 1D 05"	= "Käytäntökartoitukset (vanha)";
"06 03 55 1D 06"	= "Alipuiden rajoitin";
"06 03 55 1D 07"	= "Aiheen vaihtoehtoinen nimi (vanha)";
"06 03 55 1D 08"	= "Antajan vaihtoehtoinen nimi (vanha)";
"06 03 55 1D 09"	= "Aiheen hakemistoattribuutit";
"06 03 55 1D 0A"	= "Perusrajoitukset (vanha 2.5.29.10)";
"06 03 55 1D 0B"	= "Nimirajoitukset (vanha)";
"06 03 55 1D 0C"	= "Käytäntörajoitukset (vanha)";
"06 03 55 1D 0D"	= "Perusrajoitukset (vanha 2.5.29.13)";
"06 03 55 1D 0E"	= "Kohteen avaintunniste (SKID)";
"06 03 55 1D 0F"	= "Avaimen käyttö";
"06 03 55 1D 10"	= "Yksityisen avaimen käyttöaika";
"06 03 55 1D 11"	= "Aiheen vaihtoehtoinen nimi";
"06 03 55 1D 12"	= "Antajan vaihtoehtoinen nimi";
"06 03 55 1D 13"	= "Perusrajoitukset";
"06 03 55 1D 14"	= "Varmenteen sulkulistan numero";
"06 03 55 1D 15"	= "CRL-syykoodi";
"06 03 55 1D 16"	= "Vanhentumispäiväys (vanha)";
"06 03 55 1D 17"	= "Pito-ohjekoodi";
"06 03 55 1D 18"	= "Virheellisyyspäivä";
"06 03 55 1D 19"	= "CRL-jakopisteet (vanha)";
"06 03 55 1D 1A"	= "Antava jakopiste (vanha)";
"06 03 55 1D 1B"	= "Delta CRL -osoitin";
"06 03 55 1D 1C"	= "Antava jakopiste";
"06 03 55 1D 1D"	= "Varmenteen myöntäjä";
"06 03 55 1D 1E"	= "Nimirajoitukset";
"06 03 55 1D 1F"	= "CRL-jakopisteet";
"06 03 55 1D 20"	= "Varmennekäytännöt";
"06 04 55 1D 20 00"	= "Any-Policy -käytäntötunnus";
"06 03 55 1D 21"	= "Käytäntökartoitukset";
"06 03 55 1D 22"	= "Käytäntörajoitukset";
"06 03 55 1D 23"	= "Varmentajan avaintunniste (AKID)";
"06 03 55 1D 24"	= "Käytäntörajoitukset";
"06 03 55 1D 25"	= "Laajennettu avaimen käyttö";
"06 04 55 1D 25 00"	= "Mikä tahansa laajennettu avainten käyttö";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "SDNS-allekirjoitusalgoritmi";
"06 09 60 86 48 01 65 02 01 01 02"	= "Fortezza-allekirjoitusalgoritmi";
"06 09 60 86 48 01 65 02 01 01 03"	= "SDNS-luottamuksellisuusalgoritmi";
"06 09 60 86 48 01 65 02 01 01 04"	= "Fortezza-luottamuksellisuusalgoritmi";
"06 09 60 86 48 01 65 02 01 01 05"	= "SDNS-eheysalgoritmi";
"06 09 60 86 48 01 65 02 01 01 06"	= "Fortezza-eheysalgoritmi";
"06 09 60 86 48 01 65 02 01 01 07"	= "SDNS-tunnistesuojausalgoritmi";
"06 09 60 86 48 01 65 02 01 01 08"	= "Fortezza-tunnistesuojausalgoritmi";
"06 09 60 86 48 01 65 02 01 01 09"	= "SDNS-avaintenhallinta-algoritmi";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Fortezza-avaintenhallinta-algoritmi";
"06 09 60 86 48 01 65 02 01 01 0B"	= "SDNS-avaintenhallinta- ja allekirjoitusalgoritmi";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Fortezza-avaintenhallinta- ja allekirjoitusalgoritmi";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Suite A -allekirjoitusalgoritmi";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Suite A -luottamuksellisuusalgoritmi";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Suite A -eheysalgoritmi";
"06 09 60 86 48 01 65 02 01 01 10"	= "Suite A -tunnistesuojausalgoritmi";
"06 09 60 86 48 01 65 02 01 01 11"	= "Suite A -avaintenhallinta-algoritmi";
"06 09 60 86 48 01 65 02 01 01 12"	= "Suite A -avaintenhallinta- ja allekirjoitusalgoritmi";
"06 09 60 86 48 01 65 02 01 01 13"	= "Fortezza-päivitystenallekirjoitusalgoritmi";
"06 09 60 86 48 01 65 02 01 01 14"	= "Fortezza-avaintenhallinta- ja päivitystenallekirjoitusalgoritmi";
"06 09 60 86 48 01 65 02 01 01 15"	= "Fortezza Updated -eheysalgoritmi";
"06 09 60 86 48 01 65 02 01 01 16"	= "Avaintenvaihtoalgoritmi";
"06 09 60 86 48 01 65 02 01 01 17"	= "Fortezza Wrap80 -algoritmi";
"06 09 60 86 48 01 65 02 01 01 18"	= "Avaintensalausalgoritmi (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "RFC 822 -viestimuoto";
"06 09 60 86 48 01 65 02 01 02 02"	= "Ei sisältöä";
"06 09 60 86 48 01 65 02 01 02 03"	= "CSP-sisältötyyppi";
"06 09 60 86 48 01 65 02 01 02 2A"	= "MSP Rev 3 -sisältötyyppi";
"06 09 60 86 48 01 65 02 01 02 30"	= "MSP-sisältötyyppi";
"06 09 60 86 48 01 65 02 01 02 31"	= "MSP Rekey Agent Protocol";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "MSP Rev 3.1 -sisältötyyppi";
"06 09 60 86 48 01 65 02 01 02 48"	= "Edelleenlähetetyn MSP-viestin perusosa";
"06 09 60 86 48 01 65 02 01 02 49"	= "Edelleenlähetetyn MSP-viestin parametrit";
"06 09 60 86 48 01 65 02 01 02 50"	= "Edelleenlähetetyn CSP-viestin perusosa";
"06 09 60 86 48 01 65 02 01 02 51"	= "Edelleenlähetetyn CSP-viestin parametrit";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "SDNS-suojauskäytäntö";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Suojauskäytäntö";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Yleinen";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Oletusarvoinen suojauskäytäntö";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "SDNS-avaintenhallintavarmenne";
"06 09 60 86 48 01 65 02 01 05 02"	= "SDNS-käyttäjän allekirjoitusvarmenne";
"06 09 60 86 48 01 65 02 01 05 03"	= "SDNS-avaintenhallinta- ja allekirjoitusvarmenne";
"06 09 60 86 48 01 65 02 01 05 04"	= "Fortezza-avaintenhallintavarmenne";
"06 09 60 86 48 01 65 02 01 05 05"	= "Fortezza-avaintenhallinta- ja allekirjoitusvarmenne";
"06 09 60 86 48 01 65 02 01 05 06"	= "Fortezza-käyttäjän allekirjoitusvarmenne";
"06 09 60 86 48 01 65 02 01 05 07"	= "Fortezza-varmentajan allekirjoitusvarmenne";
"06 09 60 86 48 01 65 02 01 05 08"	= "SDNS-varmentajan allekirjoitusvarmenne";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Apuvektori";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Kuittauskäytäntö";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Jäsenyys";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Ylläpitäjät";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS Signature CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS-allekirjoituksen CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "SDNS-varmenteen sulkulista";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Fortezza-varmenteen sulkulista";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Exempted Address Processor";
"06 09 60 86 48 01 65 02 01 05 30"	= "Vahti";
"06 09 60 86 48 01 65 02 01 05 31"	= "Tuetut algoritmit";
"06 09 60 86 48 01 65 02 01 05 32"	= "Suite A -avaintenhallintavarmenne";
"06 09 60 86 48 01 65 02 01 05 33"	= "Suite A -avaintenhallinta- ja allekirjoitusvarmenne";
"06 09 60 86 48 01 65 02 01 05 34"	= "Suite A -käyttäjän allekirjoitusvarmenne";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC-tiedot";
"06 09 60 86 48 01 65 02 01 05 36"	= "PRBAC-varmentajan rajoitukset";
"06 09 60 86 48 01 65 02 01 05 37"	= "Allekirjoitus- tai avaintenhallintaoikeudet";
"06 09 60 86 48 01 65 02 01 05 38"	= "Viestintäoikeudet";
"06 09 60 86 48 01 65 02 01 05 39"	= "Merkitty attribuutti";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Käytäntötietotiedosto";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Turvallisuusmenetelmätietotiedosto";
"06 09 60 86 48 01 65 02 01 05 3C"	= "CA Clearance Constraint";

"06 09 60 86 48 01 65 02 01 07 01"		= "CSP-laajennukset";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "ISSI-suojauskategoriat";
"06 09 60 86 48 01 65 02 01 08 02"		= "Standardisuojausmerkintäoikeudet";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Allekirjoitusoikeudet";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Avaintenhallintaoikeudet";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Named Tag Set Privilege";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Yhdysvaltain puolustusministeriö luokka 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Yhdysvaltain puolustusministeriö luokka 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Yhdysvaltain puolustusministeriö luokka 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Yhdysvaltain puolustusministeriö luokka 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "Yhdysvaltain puolustusministeriö PKI-luokka 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Testisuojauskäytäntö";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1-merkkisarja nolla";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1-merkkisarja yksi";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1-merkkisarja kaksi";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2-suojauskategoriat";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2-merkkisarja nolla";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2-merkkisarja yksi";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2-merkkisarja kaksi";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kafka-suojauskategoriat";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka Tag Set Name 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka Tag Set Name 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka Tag Set Name 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Varmenteiden kumousluettelon testi";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Merkki";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "GAK-käytäntötunnus";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "FBCA Rudimentary Policy Identifier";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "FBCA Basic Policy Identifier";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "FBCA Medium Policy Identifier";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "FBCA High Policy Identifier";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "KRA-avain";
"06 08 60 86 48 01 65 03 02 03"			= "Laajennukset";
"06 09 60 86 48 01 65 03 02 03 01"		= "Key Recovery Technique";
"06 09 60 86 48 01 65 03 02 03 02"		= "Key Recovery Capable";
"06 09 60 86 48 01 65 03 02 03 03"		= "Avaimen palauttaminen";
"06 08 60 86 48 01 65 03 02 04"			= "Key Recovery Schemes";
"06 08 60 86 48 01 65 03 02 05"			= "CSOR GAK -laajennus";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "NIST-algoritmi";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-512";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Novell-algoritmi";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 ja RSA-salaus BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 ja RSA-salaus BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 ja RSA-salaus BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM Digest";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC ja SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC ja MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4-paketti";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA-salaus BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "NW-salasana";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "PKI-attribuuttityyppi";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Suojausattribuutit";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Luottamusraja";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Netscape-objektin tunniste";
"06 08 60 86 48 01 86 F8 42 01"		= "Netscape Certificate Extension";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Netscape-varmennetyyppi";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Netscape Base URL";
"06 09 60 86 48 01 86 F8 42 01 03"	= "Netscape Revocation URL";
"06 09 60 86 48 01 86 F8 42 01 04"	= "Netscape CA Revocation URL";
"06 09 60 86 48 01 86 F8 42 01 05"	= "Netscape CRL Download URL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "Netscape CA Certificate Download URL";
"06 09 60 86 48 01 86 F8 42 01 07"	= "Netscape Certificate Renewal URL";
"06 09 60 86 48 01 86 F8 42 01 08"	= "Netscape CA Policy URL";
"06 09 60 86 48 01 86 F8 42 01 09"	= "Netscape Certificate Homepage URL";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Netscape Certificate Entity Logo";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Netscape Certificate User Picture";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Netscapen SSL-palvelimen nimi";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Netscape Certificate Comment";

"06 08 60 86 48 01 86 F8 42 02"		= "Netscapen datatyyppi";
"06 09 60 86 48 01 86 F8 42 02 01"	= "kuva/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "kuva/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "Osoite";
"06 09 60 86 48 01 86 F8 42 02 04"	= "teksti/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Netscape Certificate Sequence";
"06 09 60 86 48 01 86 F8 42 02 06"	= "Netscape Certificate URL";

"06 08 60 86 48 01 86 F8 42 03"			= "Netscape Directory -objektitunniste";
"06 09 60 86 48 01 86 F8 42 03 01"		= "LDAP-määritelmät";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Car License";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Department Number";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Tyontekijänumero";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Työntekijätyyppi";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Intranet Organizational Person";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Server Gated Crypto";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Tuntematon Verisign VPN -tarkenne";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Tuntematon Verisign VPN -tarkenne";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Verisign-käytäntötunnus";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign CPS v1 -ilmoitus";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Sisällön tyyppi";
"06 04 67 2A 00 00"	= "PAN-data";
"06 04 67 2A 00 01"	= "PAN-merkki";
"06 04 67 2A 00 02"	= "Vain PAN";

"06 03 67 2A 01"	= "Viestin laajennus";
"06 03 67 2A 02"	= "Kenttä";
"06 04 67 2A 02 00"	= "Nimi";
"06 04 67 2A 02 01"	= "Etunimi";
"06 04 67 2A 02 02"	= "Sukunimi";
"06 04 67 2A 02 03"	= "Omaa sukua";
"06 04 67 2A 02 04"	= "Paikannimi";
"06 04 67 2A 02 05"	= "Henkilötunnus";
"06 04 67 2A 02 06"	= "Kuukausi";
"06 04 67 2A 02 07"	= "Päiväys";
"06 04 67 2A 02 08"	= "Osoite";
"06 04 67 2A 02 09"	= "Puhelin";
"06 04 67 2A 02 0A"	= "Määrä";
"06 04 67 2A 02 0B"	= "Tilinumero";
"06 04 67 2A 02 0C"	= "Salauslause";

"06 03 67 2A 03"		= "Attribuutti";
"06 04 67 2A 03 00"		= "Varmenne";
"06 05 67 2A 03 00 00"	= "Juuriavaimen peukalonjälki";
"06 05 67 2A 03 00 01"	= "Lisäkäytäntö";

"06 03 67 2A 04"	= "Algoritmi";
"06 03 67 2A 05"	= "Käytäntö";
"06 04 67 2A 05 00"	= "Juuri";
"06 03 67 2A 06"	= "Moduuli";
"06 03 67 2A 07"	= "Varmenteen laajennus";
"06 04 67 2A 07 00"	= "Tarkistussummattu juuriavain";
"06 04 67 2A 07 01"	= "Varmennetyyppi";
"06 04 67 2A 07 02"	= "Myyjän tiedot";
"06 04 67 2A 07 03"	= "Korttivarmenne vaaditaan";
"06 04 67 2A 07 04"	= "Tunnelointi";
"06 04 67 2A 07 05"	= "SET-laajennukset";
"06 04 67 2A 07 06"	= "SET-määrite";

"06 03 67 2A 08"	= "Merkki";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Valmistaja";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Kansallinen";
"06 05 67 2A 0A E2 00"	= "Japani";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Tarkistussummattu juuriavain";
"06 04 86 8D 6F 03"	= "Varmennetyyppi";
"06 04 86 8D 6F 04"	= "Myyjän tiedot";
"06 04 86 8D 6F 05"	= "Korttivarmenne vaaditaan";
"06 04 86 8D 6F 06"	= "Tunnelointi";
"06 04 86 8D 6F 07"	= "SET-määrite";
"06 04 86 8D 6F 63"	= "SET-data";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Applen tietosuoja";

"06 08 2A 86 48 86 F7 63 64 01" = "Applen luottamuskäytännön tunniste";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Apple iSign -käytäntö";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Applen X.509-peruskäytäntö";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Applen SSL-käytäntö";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Applen paikallisen varmenteen luontikäytäntö";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Applen paikallinen CSR-luontikäytäntö";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Applen CRL-peruutuskäytäntö";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Applen OCSP-peruutuskäytäntö";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Applen S/MIME-käytäntö";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Applen laajennettava todentamiskäytäntö";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Applen ohjelmistopäivitysten allekirjoituskäytäntö";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Apple IPsec -käytäntö";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Apple iChat -käytäntö";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Applen resurssiallekirjoituskäytäntö";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Applen Kerberos-asiakaskäytäntö";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Applen Kerberos-palvelinkäytäntö";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Applen koodiallekirjoituskäytäntö";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Applen pakettiallekirjoituskäytäntö";

"06 08 2A 86 48 86 F7 63 64 02" = "Applen suojausalgoritmin tunniste";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Fast Elliptic Encryption (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Apple Secure Compression (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE käyttäen MD5-allekirjoitusta";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE käyttäen SHA-1-allekirjoitusta";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Apple FEED -salaus";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (testi)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE käyttäen ECDSA-allekirjoitusta";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple .Mac -varmenteen tunnistin";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple .Mac -varmenteen pyyntö";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Apple .Mac -identiteettivarmenteen pyyntö";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Apple .Mac -sähköpostin kirjautumisvarmenteen pyyntö";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Apple .Mac -sähköpostin salausvarmenteen pyyntö";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Apple .Mac -hakemistoluettelon pyyntö";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Apple .Mac -hakemistotallenteen pyyntö";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Apple .Mac -hakemistonhakupyyntö";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Apple .Mac -hakemistonpoistopyyntö";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple .Mac -varmenteen laajennos";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac -identiteetti";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Apple .Mac -sähköpostin allekirjoitus";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Apple .Mac -sähköpostin salaus";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Apple .Mac -varmenteen pyyntöarvo";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Käyttäjätunnus";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Salasana";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Palvelinnimi";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Uusi lippu";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Asynkroninen lippu";

"06 08 2A 86 48 86 F7 63 64 04" = "Applen laajennettu avainten käyttö";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Applen koodiallekirjoitus";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Applen koodikirjautuminen (kehitys)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Applen ohjelmistopäivitysten allekirjoitus";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Applen koodiallekirjoitus (varattu)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Applen resurssien allekirjoitus";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Apple iChat -allekirjoittaminen";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Apple iChat -salaus";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Applen järjestelmähenkilöllisyys";

"06 08 2A 86 48 86 F7 63 64 05" = "Applen varmennekäytännöt";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Applen varmennekäytäntö";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple .Mac -varmennekäytäntö";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Koodin allekirjoitus";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Intel CDSA -suojaus";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Intel CDSA -suojausmuodot";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "X.509v3-varmennelaajennos";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "X.509v3-yksityisvarmennelaajennos";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Aiheallekirjoituksen bittikartta";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Aihekuva";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Aihesähköpostiosoite";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Käytä vapautuksia";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Intel CDSA -suojausalgoritmit";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 ja ECDSA";

/* end */
